<a href="https://colab.research.google.com/github/melanieminson/data-612/blob/master/Assignment02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment for Week 2

## Purpose:     
This assignment is intended to help you do the following:   
1.	Modify and add information on the dataset by adding and calculating new columns     
2.	Work with dates in a dataset       
3.	Learn how to write and save your work as a csv file from Jupyter Notebook.

## Action Items:       
â€¢	Create a new column using the date column.     
  1. Find the maximum date of your data.     
  2. Subtract all the dates on the column from the maximum date.       
  3. Convert the number of days into number of months.       
  4. Save the result on a new column and add to the data set.        
  5. Save the dataset as a csv file.        
  6. Upload the assignment on your GitHub account and Update the README file where you explain everything you did.

Below, I imported the HomeGames.csv file instead of the AllstarFull.csv file as I did in my first assignment because it had dates instead of years for date data.

In [0]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/frankData612/data_612/master/baseballdatabank-master/core/HomeGames.csv')

1. Below, I found the maximum date of my data by using the max function to locate the latest date in the span.last column.

In [24]:
enddates = df['span.last']

max(enddates)

'2019-09-29'

2. Below, I converted the span.last column to YYYY-MM-DD format and subtracted the dates from the maximum date in the converted span.last column.

In [25]:
df['sldates'] = pd.to_datetime(df['span.last'], format='%Y-%m-%d')

df['subdates'] = max(df['sldates']) - df['sldates']

df.head()

   year.key league.key team.key  ... attendance    sldates   subdates
0      1871        NaN      BS1  ...      32600 1871-10-07 54048 days
1      1871        NaN      BS1  ...       3000 1871-05-27 54181 days
2      1871        NaN      CH1  ...      85500 1871-09-29 54056 days
3      1871        NaN      CH1  ...        600 1871-10-30 54025 days
4      1871        NaN      CL1  ...       2200 1871-07-22 54125 days

[5 rows x 11 columns]

3. Below, I imported numpy and converted the new "subdates" column from a count of days to a count of months.

In [26]:
import numpy as np 

df['subdates']=df['subdates']/np.timedelta64(1,'M')

df.head()

   year.key league.key team.key  ... attendance    sldates     subdates
0      1871        NaN      BS1  ...      32600 1871-10-07  1775.740775
1      1871        NaN      BS1  ...       3000 1871-05-27  1780.110475
2      1871        NaN      CH1  ...      85500 1871-09-29  1776.003614
3      1871        NaN      CH1  ...        600 1871-10-30  1774.985113
4      1871        NaN      CL1  ...       2200 1871-07-22  1778.270601

[5 rows x 11 columns]

4. Throughout the assignment, I had already created and saved the new column with this updated different in months.

5. Below, I saved the updated dataframe as a csv file.

In [0]:
df.to_csv('updatedHomeGames.csv')